basic/controllers/ClientController.php

    protected function findModel($id)
    {
        if (($model = Client::findOne($id)) !== null) {
---
SELECT * FROM `client` WHERE `id`='16'