basic/controllers/ServicelistController.php

SELECT * FROM `servicelist` WHERE `id`='22'
---
    protected function findModel($id)
    {
        if (($model = Servicelist::findOne($id)) !== null) {