basic/controllers/SiteController.php

SELECT * FROM `user` WHERE `username`='admin'
INSERT INTO `user` (`username`, `email`, `password_hash`, `auth_key`, `status`, `created_at`, `updated_at`) VALUES ('admin', 'admin@mysite.ru', '$2y$13$aPyjDw6PPk6E1LV5kzuNveEnv.A/bEZWr3e4UujogSgtzg./MNgsK', 'zrQn0pIhFb6mARN9C0kHgfKKrak-UV0A', 10, 1565901551, 1565901551)
---
	public function actionAddAdmin() {
        $model = User::find()->where(['username' => 'admin'])->one();
        if (empty($model)) {
            $user = new User();
            $user->username = 'admin';
            $user->email = 'admin@mysite.ru';
            $user->setPassword('admin');
            $user->generateAuthKey();
            if ($user->save()) {