basic/views/servicelist/_form.php

SELECT concat(fname,' ',lname) AS `full_name` FROM `client`
---
        'options' => [
            '' => ['Selected' => true]]]) ?>

	<?= $form->field($model, 'user')->dropDownList(ArrayHelper::map(Client::find()->select(["concat(fname,' ',lname) as full_name"])->asArray()->all(), 'full_name', 'full_name'),['prompt'=>'Select User',
        'options' => [
            '' => ['Selected' => true],
			]])->label('User Fist Name & User Last Name') ?>

SELECT * FROM `client`
---

    <?= $form->field($model, 'domain')->textInput(['maxlength' => true]) ?>

	<?= $form->field($model, 'user_id')->dropDownList(ArrayHelper::map(Client::find()->asArray()->all(), 'id', 'id'),['prompt'=>'Select User',
        'options' => [
            '' => ['Selected' => true],
			]])->hint('Please don\'t change User ID')->label('User ID') ?>