basic/views/servicelist/index.php

				'header' => 'User',
				'attribute' => 'user',
				'value' => 'user',
				'filter' => Html::activeDropDownList($searchModel, 'user', ArrayHelper::map(Client::find()->select(["concat(fname,' ',lname) as full_name"])->asArray()->all(), 'full_name', 'full_name'),['class'=>'form-control','prompt' => 'Select User']),
---
SELECT concat(fname,' ',lname) AS `full_name` FROM `client`